clear
clc

Loading_weight = 2000;
Curb_weight = 1800;
Total_weight = 3880;
r = 0.367;
Eta_T = 0.85;
f = 0.013;
CDA = 2.77;
i0 = 5.83;
ig = [5.56 2.769 1.644 1.00 0.793];
If = 0.218;
Iw1 = 1.798;
Iw2 = 3.598;
L = 3.2;
a = 1.974;
hg = 0.9;
nmin = 600;
nmax = 4000;
G = Total_weight * 9.8;



n_ = [815 1207 1614 2012 2603 3006 3403 3804];
B_ = [1326.8 1354.7 1284.4 1122.9 1141.0 1051.2 1233.9 1129.7;
    -416.46 -303.98 -189.75 -121.59 -98.893 -73.714 -84.478 -45.291;
    72.379 36.657 14.524 7.0035 4.4763 2.8593 2.9788 0.71113;
    -5.8629 -2.0553 -0.51184 -0.18517 -0.091077 -0.05138 -0.047449 -0.00075215;
    0.17768 0.043072 0.0068164 0.0018555 0.00068906 0.00035032 0.00028230 -0.000038568];

roug = 7;

for i = 1:5
    now_ig = ig(i);
    n = nmin:1:nmax;
    ua = 0.377 * r * n / (now_ig * i0);
    Ttq = -19.313 + 295.27 * (n / 1000) - 165.44 * (n / 1000).^2 + 40.874 * (n / 1000).^3 - 3.8445 * (n / 1000).^4;

    % 利用插值法求拟合公式
    ua_ = 0.377 * r * n_ / (now_ig * i0);
    Pe = (G * f * ua_ / 3600 + CDA * ua_.^3/76140) / Eta_T;
    b_ = zeros(1, 8);
    for k = 1:8
        b_(k) = B_(:, k)' * [1; Pe(k); Pe(k)^2; Pe(k)^3; Pe(k)^4];
    end
    ua2b(i, :) = polyfit(ua_, b_, 4);


    % 计算最高与次高档燃油消耗曲线
    if i >= 4
        b = polyval(ua2b(i, :), ua);
        Ff = Total_weight * 9.8 * (f + 0 * ua);
        Fw = CDA / 21.15 * ua.^2;
        Pf_Pw = (1 / Eta_T) * (Ff .* ua ./ 3600 + Fw .* ua ./ 3600);
        Pe = Pf_Pw;
        Q = Pe .* b ./ (1.02 .* ua .* roug);

        % 尾部数据偏差过大，剔除
        index = find(ua > 96);
        if isempty(index)
            [~, index] = size(ua);
        else
            index = index(1);
        end

        plot(ua(1:index), Q(1:index));
        hold on
    end

end


legend('4档', '5档');
title('等速百公里燃油消耗曲线');
xlabel('ua/(km/h)');
ylabel('百公里油耗Qs(L/100km)');
